# UnifiedbitmapRGBAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnifiedBitmap..::..UnifiedbitmapRGBAmount Property
UnifiedBitmap Class See Also
---
The property labeled "Brightness" from the "UnifiedBitmap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string UnifiedbitmapRGBAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnifiedbitmapRGBAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ UnifiedbitmapRGBAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
UnifiedBitmap Class
Autodesk.Revit.DB.Visual Namespace